app/admin/insales_sync.rb

SELECT MAX("product_stocks"."synced_at") FROM "product_stocks" WHERE "product_stocks"."store_name" = 'Тест'
---
    store_name = defined?(MoyskladClient::TEST_STORE_NAME) ? MoyskladClient::TEST_STORE_NAME : 'Тест'

    stock_scope = ProductStock.where(store_name: store_name)
    last_stock_sync_at = stock_scope.maximum(:synced_at)

SELECT COUNT(*) FROM "insales_product_mappings"
SELECT COUNT(*) FROM "insales_image_mappings"
---
    products_with_stock = stock_scope.select(:product_id).distinct.count
    total_stocks = stock_scope.count

    products_with_insales_mapping = InsalesProductMapping.count
    images_with_insales_mapping = InsalesImageMapping.count